Revit 2027 API
VectorAtPoint(VectorAtPoint) Constructor
 Creates a copy of the given VectorAtPoint instance.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VectorAtPoint(
	VectorAtPoint otherObject
)
Public Sub New (
	otherObject As VectorAtPoint
)
public:
VectorAtPoint(
	VectorAtPoint^ otherObject
)
new :
        otherObject : VectorAtPoint -> VectorAtPoint
Parameters
otherObject VectorAtPoint
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
VectorAtPoint Class
VectorAtPoint Overload
Autodesk.Revit.DB.Analysis Namespace